{"title": "Data Destruction", "descrption": "\nAdversaries may destroy data and files on specific systems or in large numbers on a network to interrupt availability to systems, services, and network resources. Data destruction is likely to render stored data irrecoverable by forensic techniques through overwriting files or data on local and remote drives. Common operating system file deletion commands such as del and rm often only remove pointers to files without wiping the contents of the files themselves, making the files recoverable by proper forensic methodology. This behavior is distinct from Disk Content Wipe and Disk Structure Wipe because individual files are destroyed rather than sections of a storage disk or the disk's logical structure.Adversaries may attempt to overwrite files and directories with randomly generated data to make it irrecoverable. In some cases politically oriented image files have been used to overwrite data.To maximize impact on the target organization in operations where network-wide availability interruption is the goal, malware designed for destroying data may have worm-like features to propagate across a network by leveraging additional techniques like Valid Accounts, Credential Dumping, and Windows Admin Shares.\n", "ID": "T1485", "Tactic": "Impact", "Platform": "Linux, macOS, Windows", "Permissions Required": "User, Administrator, root, SYSTEM", "Data Sources": "File monitoring, Process command-line parameters, Process monitoring", "Impact Type": "Availability", "Version": "1.0", "Created": "14 March 2019", "Last Modified": "19 July 2019", "related": [{"link": "https://attack.mitre.org/groups/G0082", "Name": "APT38", "Description": "APT38 has used a custom secure delete function to make deleted files unrecoverable.[13]"}, {"link": "https://attack.mitre.org/software/S0089", "Name": "BlackEnergy", "Description": "BlackEnergy 2 contains a \"Destroy\" plug-in that destroys data stored on victim hard drives by overwriting file contents.[8]"}, {"link": "https://attack.mitre.org/software/S0265", "Name": "Kazuar", "Description": "Kazuar can overwrite files with random data before deleting them.[9]"}, {"link": "https://attack.mitre.org/groups/G0032", "Name": "Lazarus Group", "Description": "Lazarus Group has used a custom secure delete function to overwrite file contents with data from heap memory.[14]"}, {"link": "https://attack.mitre.org/software/S0365", "Name": "Olympic Destroyer", "Description": "Olympic Destroyer overwrites files locally and on remote shares. [6]"}, {"link": "https://attack.mitre.org/software/S0139", "Name": "PowerDuke", "Description": "PowerDuke has a command to write random data across a file and delete it.[10]"}, {"link": "https://attack.mitre.org/software/S0238", "Name": "Proxysvc", "Description": "Proxysvc can overwrite files indicated by the attacker before deleting them.[11]"}, {"link": "https://attack.mitre.org/software/S0364", "Name": "RawDisk", "Description": "RawDisk was used in Shamoon to write to protected system locations such as the MBR and disk partitions in an effort to destroy data.[3][5]"}, {"link": "https://attack.mitre.org/software/S0195", "Name": "SDelete", "Description": "SDelete deletes data in a way that makes it unrecoverable.[7]"}, {"link": "https://attack.mitre.org/software/S0140", "Name": "Shamoon", "Description": "Shamoon attempts to overwrite operating system files and disk structures with image files. In a later variant, randomly generated data was used for data overwrites.[1][2][3][5]"}, {"link": "https://attack.mitre.org/software/S0380", "Name": "StoneDrill", "Description": "StoneDrill has a disk wiper module that targets files other than those in the Windows directory.[4]"}, {"link": "https://attack.mitre.org/software/S0341", "Name": "Xbash", "Description": "Xbash has destroyed Linux-based databases as part of its ransomware capabilities.    [12]"}, {"Mitigation": "Data Backup", "Description": "Consider implementing IT disaster recovery plans that contain procedures for taking regular data backups that can be used to restore organizational data. Ensure backups are stored off system and is protected from common methods adversaries may use to gain access and destroy the backups to prevent recovery."}]}