{"title": "Data Encrypted for Impact", "descrption": "\nAdversaries may encrypt data on target systems or on large numbers of systems in a network to interrupt availability to system and network resources. They can attempt to render stored data inaccessible by encrypting files or data on local and remote drives and withholding access to a decryption key. This may be done in order to extract monetary compensation from a victim in exchange for decryption or a decryption key (ransomware) or to render data permanently inaccessible in cases where the key is not saved or transmitted. In the case of ransomware, it is typical that common user files like Office documents, PDFs, images, videos, audio, text, and source code files will be encrypted. In some cases, adversaries may encrypt critical system files, disk partitions, and the MBR.To maximize impact on the target organization, malware designed for encrypting data may have worm-like features to propagate across a network by leveraging other attack techniques like Valid Accounts, Credential Dumping, and Windows Admin Shares.\n", "ID": "T1486", "Tactic": "Impact", "Platform": "Linux, macOS, Windows", "Permissions Required": "User, Administrator, root, SYSTEM", "Data Sources": "Kernel drivers, File monitoring, Process command-line parameters, Process monitoring", "Impact Type": "Availability", "Version": "1.0", "Created": "15 March 2019", "Last Modified": "19 July 2019", "related": [{"link": "https://attack.mitre.org/groups/G0082", "Name": "APT38", "Description": "APT38 has used Hermes ransomware to encrypt files with AES256.[18]"}, {"link": "https://attack.mitre.org/groups/G0096", "Name": "APT41", "Description": "APT41 used a ransomware called Encryptor RaaS to encrypt files on the targeted systems and provide a ransom note to the user.[20]"}, {"link": "https://attack.mitre.org/software/S0389", "Name": "JCry", "Description": "JCry has encrypted files and demanded Bitcoin to decrypt those files.[16]"}, {"link": "https://attack.mitre.org/software/S0372", "Name": "LockerGoga", "Description": "LockerGoga has encrypted files, including core Windows OS files, using RSA-OAEP MGF1 and then demanded Bitcoin be paid for the decryption key.[11][12][13]"}, {"link": "https://attack.mitre.org/software/S0368", "Name": "NotPetya", "Description": "NotPetya encrypts user files and disk structures like the MBR with 2048-bit RSA.[9][3]"}, {"link": "https://attack.mitre.org/software/S0400", "Name": "RobbinHood", "Description": "RobbinHood will search for an RSA encryption key and then perform its encryption process on the system files. [17]"}, {"link": "https://attack.mitre.org/software/S0370", "Name": "SamSam", "Description": "SamSam encrypts victim files using RSA-2048 encryption and demands a ransom be paid in Bitcoin to decrypt those files.[10]"}, {"link": "https://attack.mitre.org/software/S0140", "Name": "Shamoon", "Description": "Shamoon has an operational mode for encrypting data instead of overwriting it.[5][6]"}, {"link": "https://attack.mitre.org/software/S0242", "Name": "SynAck", "Description": "SynAck encrypts the victims machine followed by asking the victim to pay a ransom.[15]"}, {"link": "https://attack.mitre.org/groups/G0092", "Name": "TA505", "Description": "TA505 has used a wide variety of ransomware, such as Locky, Jaff, Bart, Philadelphia, and GlobeImposter, to encrypt victim files and demand a ransom payment.[19]"}, {"link": "https://attack.mitre.org/software/S0366", "Name": "WannaCry", "Description": "WannaCry encrypts user files and demands that a ransom be paid in Bitcoin to decrypt those files.[7][2][8]"}, {"link": "https://attack.mitre.org/software/S0341", "Name": "Xbash", "Description": "Xbash has maliciously encrypted victim's database systems and demanded a cryptocurrency ransom be paid.[14]"}, {"Mitigation": "Data Backup", "Description": "Consider implementing IT disaster recovery plans that contain procedures for regularly taking and testing data backups that can be used to restore organizational data. Ensure backups are stored off system and is protected from common methods adversaries may use to gain access and destroy the backups to prevent recovery."}]}