{"title": "Drive-by Compromise", "descrption": "\nA drive-by compromise is when an adversary gains access to a system through a user visiting a website over the normal course of browsing. With this technique, the user's web browser is typically targeted for exploitation, but adversaries may also use compromised websites for non-exploitation behavior such as acquiring application access tokens.Multiple ways of delivering exploit code to a browser exist, including:A legitimate website is compromised where adversaries have injected some form of malicious code such as JavaScript, iFrames, and cross-site scripting.Malicious ads are paid for and served through legitimate ad providers.Built-in web application interfaces are leveraged for the insertion of any other kind of object that can be used to display web content or contain a script that executes on the visiting client (e.g. forum posts, comments, and other user controllable web content).Often the website used by an adversary is one visited by a specific community, such as government, a particular industry, or region, where the goal is to compromise a specific user or set of users based on a shared interest. This kind of targeted attack is referred to a strategic web compromise or watering hole attack. There are several known examples of this occurring. [1]Typical drive-by compromise process:A user visits a website that is used to host the adversary controlled content.Scripts automatically execute, typically searching versions of the browser and plugins for a potentially vulnerable version. The user may be required to assist in this process by enabling scripting or active website components and ignoring warning dialog boxes.Upon finding a vulnerable version, exploit code is delivered to the browser.If exploitation is successful, then it will give the adversary code execution on the user's system unless other protections are in place.In some cases a second visit to the website after the initial scan is required before exploit code is delivered.Unlike Exploit Public-Facing Application, the focus of this technique is to exploit software on a client endpoint upon visiting a website. This will commonly give an adversary access to systems on the internal network instead of external systems that may be in a DMZ.Adversaries may also use compromised websites to deliver a user to a malicious application designed to Steal Application Access Tokens, like OAuth tokens, to gain access to protected applications and information. These malicious applications have been delivered through popups on legitimate websites.[2]\n", "ID": "T1189", "Tactic": "Initial Access", "Platform": "Windows, Linux, macOS, SaaS", "Permissions Required": "User", "Data Sources": "Packet capture, Network device logs, Process use of network, Web proxy, Network intrusion detection system, SSL/TLS inspection", "Contributors": "Jeff Sakowicz, Microsoft Identity Developer Platform Services (IDPM Services); Saisha Agrawal, Microsoft Threat Intelligent Center (MSTIC)", "Version": "1.1", "Created": "18 April 2018", "Last Modified": "11 October 2019", "references": [{"index": 1, "title": "Adair, S., Moran, N. (2012, May 15). Cyber Espionage & Strategic Web Compromises – Trusted Websites Serving Dangerous Results. Retrieved March 13, 2018.", "external_link": "http://blog.shadowserver.org/2012/05/15/cyber-espionage-strategic-web-compromises-trusted-websites-serving-dangerous-results/"}, {"index": 2, "title": "Lassalle, D., et al. (2017, November 6). OceanLotus Blossoms: Mass Digital Surveillance and Attacks Targeting ASEAN, Asian Nations, the Media, Human Rights Groups, and Civil Society. Retrieved November 6, 2017.", "external_link": "https://www.volexity.com/blog/2017/11/06/oceanlotus-blossoms-mass-digital-surveillance-and-exploitation-of-asean-nations-the-media-human-rights-and-civil-society/"}, {"index": 3, "title": "Cowan, C. (2017, March 23). Strengthening the Microsoft Edge Sandbox. Retrieved March 12, 2018.", "external_link": "https://blogs.windows.com/msedgedev/2017/03/23/strengthening-microsoft-edge-sandbox/"}, {"index": 4, "title": "Goodin, D. (2017, March 17). Virtual machine escape fetches $105,000 at Pwn2Own hacking contest - updated. Retrieved March 12, 2018.", "external_link": "https://arstechnica.com/information-technology/2017/03/hack-that-escapes-vm-by-exploiting-edge-browser-fetches-105000-at-pwn2own/"}, {"index": 5, "title": "Nunez, N. (2017, August 9). Moving Beyond EMET II – Windows Defender Exploit Guard. Retrieved March 12, 2018.", "external_link": "https://blogs.technet.microsoft.com/srd/2017/08/09/moving-beyond-emet-ii-windows-defender-exploit-guard/"}, {"index": 6, "title": "Wikipedia. (2018, January 11). Control-flow integrity. Retrieved March 12, 2018.", "external_link": "https://en.wikipedia.org/wiki/Control-flow_integrity"}, {"index": 7, "title": "FireEye. (2018, February 20). APT37 (Reaper): The Overlooked North Korean Actor. Retrieved March 1, 2018.", "external_link": "https://www2.fireeye.com/rs/848-DID-242/images/rpt_APT37.pdf"}, {"index": 8, "title": "Trend Micro. (2017, February 27). RATANKBA: Delving into Large-scale Watering Holes against Enterprises. Retrieved May 22, 2018.", "external_link": "https://blog.trendmicro.com/trendlabs-security-intelligence/ratankba-watering-holes-against-enterprises/"}, {"index": 9, "title": "US-CERT. (2018, March 16). Alert (TA18-074A): Russian Government Cyber Activity Targeting Energy and Other Critical Infrastructure Sectors. Retrieved June 6, 2018.", "external_link": "https://www.us-cert.gov/ncas/alerts/TA18-074A"}, {"index": 10, "title": "DiMaggio, J. (2016, April 28). Tick cyberespionage group zeros in on Japan. Retrieved July 16, 2018.", "external_link": "https://www.symantec.com/connect/blogs/tick-cyberespionage-group-zeros-japan"}, {"index": 11, "title": "O'Gorman, G., and McDonald, G.. (2012, September 6). The Elderwood Project. Retrieved February 15, 2018.", "external_link": "http://www.symantec.com/content/en/us/enterprise/media/security_response/whitepapers/the-elderwood-project.pdf"}, {"index": 12, "title": "Clayton, M.. (2012, September 14). Stealing US business secrets: Experts ID two huge cyber 'gangs' in China. Retrieved February 15, 2018.", "external_link": "https://www.csmonitor.com/USA/2012/0914/Stealing-US-business-secrets-Experts-ID-two-huge-cyber-gangs-in-China"}, {"index": 13, "title": "Paganini, P. (2012, September 9). Elderwood project, who is behind Op. Aurora and ongoing attacks?. Retrieved February 13, 2018.", "external_link": "http://securityaffairs.co/wordpress/8528/hacking/elderwood-project-who-is-behind-op-aurora-and-ongoing-attacks.html"}, {"index": 14, "title": "Symantec Security Response. (2018, July 25). Leafminer: New Espionage Campaigns Targeting Middle Eastern Regions. Retrieved August 28, 2018.", "external_link": "https://www.symantec.com/blogs/threat-intelligence/leafminer-espionage-middle-east"}, {"index": 15, "title": "Hamada, J.. (2016, July 25). Patchwork cyberespionage group expands targets from governments to wide range of industries. Retrieved August 17, 2016.", "external_link": "http://www.symantec.com/connect/blogs/patchwork-cyberespionage-group-expands-targets-governments-wide-range-industries"}, {"index": 16, "title": "Meltzer, M, et al. (2018, June 07). Patchwork APT Group Targets US Think Tanks. Retrieved July 16, 2018.", "external_link": "https://www.volexity.com/blog/2018/06/07/patchwork-apt-group-targets-us-think-tanks/"}, {"index": 17, "title": "Raiu, C., and Ivanov, A. (2016, June 17). Operation Daybreak. Retrieved February 15, 2018.", "external_link": "https://securelist.com/operation-daybreak/75100/"}, {"index": 18, "title": "Blaich, A., et al. (2018, January 18). Dark Caracal: Cyber-espionage at a Global Scale. Retrieved April 11, 2018.", "external_link": "https://info.lookout.com/rs/051-ESQ-475/images/Lookout_Dark-Caracal_srr_20180118_us_v.1.0.pdf"}, {"index": 19, "title": "Grunzweig, J., Lee, B. (2016, January 22). New Attacks Linked to C0d0so0 Group. Retrieved August 2, 2018.", "external_link": "https://researchcenter.paloaltonetworks.com/2016/01/new-attacks-linked-to-c0d0s0-group/"}, {"index": 20, "title": "Windows Defender Advanced Threat Hunting Team. (2016, April 29). PLATINUM: Targeted attacks in South and Southeast Asia. Retrieved February 15, 2018.", "external_link": "https://download.microsoft.com/download/2/2/5/225BFE3E-E1DE-4F5B-A77B-71200928D209/Platinum%20feature%20article%20-%20Targeted%20attacks%20in%20South%20and%20Southeast%20Asia%20April%202016.pdf"}, {"index": 21, "title": "Dell SecureWorks Counter Threat Unit Threat Intelligence. (2015, August 5). Threat Group-3390 Targets Organizations for Cyberespionage. Retrieved August 18, 2018.", "external_link": "https://www.secureworks.com/research/threat-group-3390-targets-organizations-for-cyberespionage"}, {"index": 22, "title": "Legezo, D. (2018, June 13). LuckyMouse hits national data center to organize country-level waterholing campaign. Retrieved August 18, 2018.", "external_link": "https://securelist.com/luckymouse-hits-national-data-center/86083/"}, {"index": 23, "title": "Foltýn, T. (2018, March 13). OceanLotus ships new backdoor using old tricks. Retrieved May 22, 2018.", "external_link": "https://www.welivesecurity.com/2018/03/13/oceanlotus-ships-new-backdoor/"}, {"index": 24, "title": "FireEye. (2018, October 03). APT38: Un-usual Suspects. Retrieved November 6, 2018.", "external_link": "https://content.fireeye.com/apt/rpt-apt38"}, {"index": 25, "title": "Kaspersky Lab's Global Research and Analysis Team. (2014, November). The Darkhotel APT A Story of Unusual Hospitality. Retrieved November 12, 2014.", "external_link": "https://media.kasperskycontenthub.com/wp-content/uploads/sites/43/2018/03/08070903/darkhotel_kl_07.11.pdf"}], "related": [{"link": "https://attack.mitre.org/groups/G0073", "Name": "APT19", "Description": "APT19 performed a watering hole attack on forbes.com in 2014 to compromise targets.[19]"}, {"link": "https://attack.mitre.org/groups/G0050", "Name": "APT32", "Description": "APT32 has infected victims by tricking them into visiting compromised watering hole websites.[23]"}, {"link": "https://attack.mitre.org/groups/G0067", "Name": "APT37", "Description": "APT37 has used strategic web compromises, particularly of South Korean websites, to distribute malware. The group has also used torrent file-sharing sites to more indiscriminately disseminate malware to victims. As part of their compromises, the group has used a Javascript based profiler called RICECURRY to profile a victim's web browser and deliver malicious code accordingly.[17][7]"}, {"link": "https://attack.mitre.org/groups/G0082", "Name": "APT38", "Description": "APT38 has conducted watering holes schemes to gain initial access to victims.[24]"}, {"link": "https://attack.mitre.org/groups/G0060", "Name": "BRONZE BUTLER", "Description": "BRONZE BUTLER compromised three Japanese websites using a Flash exploit to perform watering hole attacks.[10]"}, {"link": "https://attack.mitre.org/groups/G0070", "Name": "Dark Caracal", "Description": "Dark Caracal leveraged a watering hole to serve up malicious code.[18]"}, {"link": "https://attack.mitre.org/groups/G0012", "Name": "Darkhotel", "Description": "Darkhotel used embedded iframes on hotel login portals to redirect selected victims to download malware.[25]"}, {"link": "https://attack.mitre.org/groups/G0074", "Name": "Dragonfly 2.0", "Description": "Dragonfly 2.0 compromised legitimate organizations' websites to create watering holes to compromise victims.[9]"}, {"link": "https://attack.mitre.org/groups/G0066", "Name": "Elderwood", "Description": "Elderwood has delivered zero-day exploits and malware to victims by injecting malicious code into specific public Web pages visited by targets within a particular sector.[11][12][13]"}, {"link": "https://attack.mitre.org/software/S0215", "Name": "KARAE", "Description": "KARAE was distributed through torrent file-sharing websites to South Korean victims, using a YouTube video downloader application as a lure.[7]"}, {"link": "https://attack.mitre.org/groups/G0032", "Name": "Lazarus Group", "Description": "Lazarus Group delivered RATANKBA to victims via a compromised legitimate website.[8]"}, {"link": "https://attack.mitre.org/groups/G0077", "Name": "Leafminer", "Description": "Leafminer has infected victims using watering holes.[14]"}, {"link": "https://attack.mitre.org/groups/G0040", "Name": "Patchwork", "Description": "Patchwork has used watering holes to deliver files with exploits to initial victims.[15][16]"}, {"link": "https://attack.mitre.org/groups/G0068", "Name": "PLATINUM", "Description": "PLATINUM has sometimes used drive-by attacks against vulnerable browser plugins.[20]"}, {"link": "https://attack.mitre.org/software/S0216", "Name": "POORAIM", "Description": "POORAIM has been delivered through compromised sites acting as watering holes.[7]"}, {"link": "https://attack.mitre.org/groups/G0027", "Name": "Threat Group-3390", "Description": "Threat Group-3390 has extensively used strategic web compromises to target victims.[21][22]"}, {"Mitigation": "Application Isolation and Sandboxing", "Description": "Browser sandboxes can be used to mitigate some of the impact of exploitation, but sandbox escapes may still exist.Other types of virtualization and application microsegmentation may also mitigate the impact of client-side exploitation. The risks of additional exploits and weaknesses in implementation may still exist for these types of systems.[3][4]"}, {"Mitigation": "Exploit Protection", "Description": "Security applications that look for behavior used during exploitation such as Windows Defender Exploit Guard (WDEG) and the Enhanced Mitigation Experience Toolkit (EMET) can be used to mitigate some exploitation behavior. Control flow integrity checking is another way to potentially identify and stop a software exploit from occurring. Many of these protections depend on the architecture and target application binary for compatibility.[5][6]"}, {"Mitigation": "Restrict Web-Based Content", "Description": "For malicious code served up through ads, adblockers can help prevent that code from executing in the first place.Script blocking extensions can help prevent the execution of JavaScript that may commonly be used during the exploitation process."}, {"Mitigation": "Update Software", "Description": "Ensure all browsers and plugins kept updated can help prevent the exploit phase of this technique. Use modern browsers with security features turned on."}]}