{"title": "Indicator Removal on Host", "descrption": "\nAdversaries may delete or alter generated artifacts on a host system, including logs and potentially captured files such as quarantined malware. Locations and format of logs will vary, but typical organic system logs are captured as Windows events or Linux/macOS files such as Bash History and /var/log/* .Actions that interfere with eventing and other notifications that can be used to detect intrusion activity may compromise the integrity of security solutions, causing events to go unreported. They may also make forensic analysis and incident response more difficult due to lack of sufficient data to determine what occurred.Clear Windows Event LogsWindows event logs are a record of a computer's alerts and notifications. Microsoft defines an event as \"any significant occurrence in the system or in a program that requires users to be notified or an entry added to a log.\" There are three system-defined sources of Events: System, Application, and Security.Adversaries performing actions related to account management, account logon and directory service access, etc. may choose to clear the events in order to hide their activities.The event logs can be cleared with the following utility commands:wevtutil cl systemwevtutil cl applicationwevtutil cl securityLogs may also be cleared through other mechanisms, such as PowerShell.\n", "ID": "T1070", "Tactic": "Defense Evasion", "Platform": "Linux, macOS, Windows", "System Requirements": "Clearing the Windows event logs requires Administrator permissions", "Data Sources": "File monitoring, Process monitoring, Process command-line parameters, API monitoring, Windows event logs", "Defense Bypassed": "Log analysis, Host intrusion prevention systems, Anti-virus", "CAPEC ID": "CAPEC-93", "Contributors": "Ed Williams, Trustwave, SpiderLabs", "Version": "1.0", "Created": "31 May 2017", "Last Modified": "18 July 2019", "related": [{"link": "https://attack.mitre.org/groups/G0007", "Name": "APT28", "Description": "APT28 has cleared event logs, including by using the commands wevtutil cl System and wevtutil cl Security.[20][21]"}, {"link": "https://attack.mitre.org/groups/G0016", "Name": "APT29", "Description": "APT29 used SDelete to remove artifacts from victims.[28]"}, {"link": "https://attack.mitre.org/groups/G0050", "Name": "APT32", "Description": "APT32 has cleared select event log entries.[24]"}, {"link": "https://attack.mitre.org/groups/G0082", "Name": "APT38", "Description": "APT38 clears Window Event logs and Sysmon logs from the system.[27]"}, {"link": "https://attack.mitre.org/groups/G0096", "Name": "APT41", "Description": "APT41 attempted to remove evidence of some of its activity by clearing Windows security and system events.[29]"}, {"link": "https://attack.mitre.org/software/S0239", "Name": "Bankshot", "Description": "Bankshot delets all artifacts associated with the malware from the infected machine.[6]"}, {"link": "https://attack.mitre.org/software/S0089", "Name": "BlackEnergy", "Description": "The BlackEnergy component KillDisk is capable of deleting Windows Event Logs.[7]"}, {"link": "https://attack.mitre.org/groups/G0074", "Name": "Dragonfly 2.0", "Description": "Dragonfly 2.0 cleared Windows event logs and other logs produced by tools they used, including system, security, terminal services, remote services, and audit logs. The actors also deleted specific Registry keys.[22][23]"}, {"link": "https://attack.mitre.org/groups/G0053", "Name": "FIN5", "Description": "FIN5 has cleared event logs from victims.[25]"}, {"link": "https://attack.mitre.org/groups/G0061", "Name": "FIN8", "Description": "FIN8 has cleared logs during post compromise cleanup activities.[26]"}, {"link": "https://attack.mitre.org/software/S0182", "Name": "FinFisher", "Description": "FinFisher clears the system event logs.[4][5]"}, {"link": "https://attack.mitre.org/software/S0032", "Name": "gh0st RAT", "Description": "gh0st RAT is able to wipe event logs.[11]"}, {"link": "https://attack.mitre.org/software/S0203", "Name": "Hydraq", "Description": "Hydraq creates a backdoor through which remote attackers can clear all system event logs.[13][14]"}, {"link": "https://attack.mitre.org/software/S0083", "Name": "Misdat", "Description": "Misdat is capable of deleting Registry keys used for persistence.[8]"}, {"link": "https://attack.mitre.org/software/S0368", "Name": "NotPetya", "Description": "NotPetya uses wevtutil to clear the Windows event logs.[18]"}, {"link": "https://attack.mitre.org/software/S0365", "Name": "Olympic Destroyer", "Description": "Olympic Destroyer will attempt to clear the System and Security event logs using wevtutil.[17]"}, {"link": "https://attack.mitre.org/software/S0229", "Name": "Orz", "Description": "Orz can overwrite Registry settings to reduce its visibility on the victim.[2]"}, {"link": "https://attack.mitre.org/software/S0113", "Name": "Prikormka", "Description": "After encrypting log files, the log encryption module in Prikormka deletes the original, unencrypted files from the host.[9]"}, {"link": "https://attack.mitre.org/software/S0279", "Name": "Proton", "Description": "Proton removes logs from /var/logs and /Library/logs.[10]"}, {"link": "https://attack.mitre.org/software/S0192", "Name": "Pupy", "Description": "Pupy has a module to clear event logs with PowerShell.[1]"}, {"link": "https://attack.mitre.org/software/S0148", "Name": "RTM", "Description": "RTM has the ability to remove Registry entries that it created during execution.[3]"}, {"link": "https://attack.mitre.org/software/S0253", "Name": "RunningRAT", "Description": "RunningRAT contains code to clear event logs.[15]"}, {"link": "https://attack.mitre.org/software/S0242", "Name": "SynAck", "Description": "SynAck clears event logs.[12]"}, {"link": "https://attack.mitre.org/software/S0330", "Name": "Zeus Panda", "Description": "Zeus Panda can uninstall scripts and delete files to cover its track.[16]"}, {"link": "https://attack.mitre.org/software/S0412", "Name": "ZxShell", "Description": "ZxShell has a command to clear system event logs. [19]"}, {"Mitigation": "Encrypt Sensitive Information", "Description": "Obfuscate/encrypt event files locally and in transit to avoid giving feedback to an adversary."}, {"Mitigation": "Remote Data Storage", "Description": "Automatically forward events to a log server or data repository to prevent conditions in which the adversary can locate and manipulate data on the local system. When possible, minimize time delay on event reporting to avoid prolonged storage on the local system."}, {"Mitigation": "Restrict File and Directory Permissions", "Description": "Protect generated event files that are stored locally with proper permissions and authentication and limit opportunities for adversaries to increase privileges by preventing Privilege Escalation opportunities."}]}