{"title": "Modify Registry", "descrption": "\nAdversaries may interact with the Windows Registry to hide configuration information within Registry keys, remove information as part of cleaning up, or as part of other techniques to aid in Persistence and Execution.Access to specific areas of the Registry depends on account permissions, some requiring administrator-level access. The built-in Windows command-line utility Reg may be used for local or remote Registry modification.  Other tools may also be used, such as a remote access tool, which may contain functionality to interact with the Registry through the Windows API (see examples).Registry modifications may also include actions to hide keys, such as prepending key names with a null character, which will cause an error and/or be ignored when read via Reg or other utilities using the Win32 API.  Adversaries may abuse these pseudo-hidden keys to conceal payloads/commands used to establish Persistence.  The Registry of a remote system may be modified to aid in execution of files as part of Lateral Movement. It requires the remote Registry service to be running on the target system.  Often Valid Accounts are required, along with access to the remote system's Windows Admin Shares for RPC communication.\n", "ID": "T1112", "Tactic": "Defense Evasion", "Platform": "Windows", "Permissions Required": "User, Administrator, SYSTEM", "Data Sources": "Windows Registry, File monitoring, Process monitoring, Process command-line parameters, Windows event logs", "Defense Bypassed": "Host forensic analysis", "CAPEC ID": "CAPEC-203", "Contributors": "Bartosz Jerzman; Travis Smith, Tripwire; David Lu, Tripwire", "Version": "1.0", "Created": "31 May 2017", "Last Modified": "25 June 2019", "related": [{"link": "https://attack.mitre.org/software/S0045", "Name": "ADVSTORESHELL", "Description": "ADVSTORESHELL is capable of setting and deleting Registry values.[14]"}, {"link": "https://attack.mitre.org/groups/G0073", "Name": "APT19", "Description": "APT19 uses a Port 22 malware variant to modify several Registry keys.[54]"}, {"link": "https://attack.mitre.org/groups/G0050", "Name": "APT32", "Description": "APT32's backdoor has modified the Windows Registry to store the backdoor's configuration.[61]"}, {"link": "https://attack.mitre.org/groups/G0082", "Name": "APT38", "Description": "APT38 uses a tool called CLEANTOAD that has the capability to modify Registry keys.[56]"}, {"link": "https://attack.mitre.org/groups/G0096", "Name": "APT41", "Description": "APT41 used a malware variant called GOODLUCK to modify the registry in order to steal credentials.[64]"}, {"link": "https://attack.mitre.org/software/S0031", "Name": "BACKSPACE", "Description": "BACKSPACE is capable of deleting Registry keys, sub-keys, and values on a victim system.[8]"}, {"link": "https://attack.mitre.org/software/S0245", "Name": "BADCALL", "Description": "BADCALL modifies the firewall Registry key SYSTEM\\CurrentControlSet\\Services\\SharedAccess\\Parameters\\FirewallPolicy\\StandardProfileGloballyOpenPorts\\List.[11]"}, {"link": "https://attack.mitre.org/software/S0239", "Name": "Bankshot", "Description": "Bankshot writes data into the Registry key HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Pniumj.[45]"}, {"link": "https://attack.mitre.org/software/S0348", "Name": "Cardinal RAT", "Description": "Cardinal RAT sets HKCU\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows\\Load to point to its executable.[37]"}, {"link": "https://attack.mitre.org/software/S0261", "Name": "Catchamas", "Description": "Catchamas creates three Registry keys to establish persistence by adding a New Service.[18]"}, {"link": "https://attack.mitre.org/software/S0023", "Name": "CHOPSTICK", "Description": "CHOPSTICK may store RC4 encrypted configuration information in the Windows Registry.[41]"}, {"link": "https://attack.mitre.org/software/S0334", "Name": "DarkComet", "Description": "DarkComet adds a Registry value for its installation routine to the Registry Key HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\System Enable LUA=\"0\" and HKEY_CURRENT_USER\\Software\\DC3_FEXEC.[34][35]"}, {"link": "https://attack.mitre.org/groups/G0074", "Name": "Dragonfly 2.0", "Description": "Dragonfly 2.0 modified the Registry to perform multiple techniques through the use of Reg.[53]"}, {"link": "https://attack.mitre.org/software/S0343", "Name": "Exaramel for Windows", "Description": "Exaramel for Windows adds the configuration to the Registry in XML format.[36]"}, {"link": "https://attack.mitre.org/software/S0267", "Name": "FELIXROOT", "Description": "FELIXROOT deletes the Registry key HKCU\\Software\\Classes\\Applications\\rundll32.exe\\shell\\open.[38]"}, {"link": "https://attack.mitre.org/groups/G0061", "Name": "FIN8", "Description": "FIN8 has deleted Registry keys during post compromise cleanup activities.[59]"}, {"link": "https://attack.mitre.org/groups/G0078", "Name": "Gorgon Group", "Description": "Gorgon Group malware can deactivate security mechanisms in Microsoft Office by editing several keys and values under HKCU\\Software\\Microsoft\\Office\\.[60]"}, {"link": "https://attack.mitre.org/software/S0342", "Name": "GreyEnergy", "Description": "GreyEnergy modifies conditions in the Registry and adds keys.[46]"}, {"link": "https://attack.mitre.org/groups/G0072", "Name": "Honeybee", "Description": "Honeybee uses a batch file that modifies Registry keys to launch a DLL into the svchost.exe process.[57]"}, {"link": "https://attack.mitre.org/software/S0376", "Name": "HOPLIGHT", "Description": "HOPLIGHT has modified Managed Object Format (MOF) files within the Registry to run specific commands and create persistence on the system.   [47]"}, {"link": "https://attack.mitre.org/software/S0203", "Name": "Hydraq", "Description": "Hydraq creates a Registry subkey to register its created service, and can also uninstall itself later by deleting this value. Hydraq's backdoor also enables remote attackers to modify and delete subkeys.[22][23]"}, {"link": "https://attack.mitre.org/software/S0260", "Name": "InvisiMole", "Description": "InvisiMole has a command to create, set, copy, or delete a specified Registry key or value.[24]"}, {"link": "https://attack.mitre.org/software/S0271", "Name": "KEYMARBLE", "Description": "KEYMARBLE has a command to create Registry entries for storing data under HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\WABE\\DataPath.[44]"}, {"link": "https://attack.mitre.org/software/S0397", "Name": "LoJax", "Description": "LoJax has modified the Registry key ‘HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Session Manager\\BootExecute’ from ‘autocheck autochk ’ to ‘autocheck autoche"}, {"Mitigation": "Restrict Registry Permissions", "Description": "Ensure proper permissions are set for Registry hives to prevent users from modifying keys for system components that may lead to privilege escalation."}]}