{"title": "System Network Connections Discovery", "descrption": "\nAdversaries may attempt to get a listing of network connections to or from the compromised system they are currently accessing or from remote systems by querying for information over the network. An adversary who gains access to a system that is part of a cloud-based environment may map out Virtual Private Clouds or Virtual Networks in order to determine what systems and services are connected. The actions performed are likely the same types of discovery techniques depending on the operating system, but the resulting information may include details about the networked cloud environment relevant to the adversary's goals. Cloud providers may have different ways in which their virtual networks operate.WindowsUtilities and commands that acquire this information include netstat, \"net use,\" and \"net session\" with Net.Mac and LinuxIn Mac and Linux, netstat and lsof can be used to list current connections. who -a and w can be used to show which users are currently logged in, similar to \"net session\".\n", "ID": "T1049", "Tactic": "Discovery", "Platform": "Linux, macOS, Windows, AWS, GCP, Azure", "Permissions Required": "User, Administrator", "Data Sources": "Process monitoring, Process command-line parameters", "Contributors": "Praetorian", "Version": "2.0", "Created": "31 May 2017", "Last Modified": "06 October 2019", "related": [{"link": "https://attack.mitre.org/groups/G0018", "Name": "admin@338", "Description": "admin@338 actors used the following command following exploitation of a machine with LOWBALL malware to display network connections: netstat -ano >> %temp%\\download[38]"}, {"link": "https://attack.mitre.org/groups/G0006", "Name": "APT1", "Description": "APT1 used the net use command to get a listing on network connections.[39]"}, {"link": "https://attack.mitre.org/groups/G0022", "Name": "APT3", "Description": "APT3 has a tool that can enumerate current network connections.[10][35][36]"}, {"link": "https://attack.mitre.org/groups/G0050", "Name": "APT32", "Description": "APT32 used the netstat -anpo tcp command to display TCP connections on the victim's machine.[37]"}, {"link": "https://attack.mitre.org/groups/G0082", "Name": "APT38", "Description": "APT38 installed a port monitoring tool, MAPMAKER, to print the active TCP connections on the local system.[44]"}, {"link": "https://attack.mitre.org/groups/G0096", "Name": "APT41", "Description": "APT41 used the netstat command as part of network reconnaissance. The group has also used a malware variant, HIGHNOON, to enumerate active RDP sessions. [45]"}, {"link": "https://attack.mitre.org/software/S0089", "Name": "BlackEnergy", "Description": "BlackEnergy has gathered information about local network connections using netstat.[22][23]"}, {"link": "https://attack.mitre.org/software/S0335", "Name": "Carbon", "Description": "Carbon uses the netstat -r and netstat -an commands.[19]"}, {"link": "https://attack.mitre.org/software/S0244", "Name": "Comnie", "Description": "Comnie executes the netstat -ano command.[18]"}, {"link": "https://attack.mitre.org/software/S0038", "Name": "Duqu", "Description": "The discovery modules used with Duqu can collect information on network connections.[14]"}, {"link": "https://attack.mitre.org/software/S0363", "Name": "Empire", "Description": "Empire can enumerate the current network connections of a host.[7]"}, {"link": "https://attack.mitre.org/software/S0091", "Name": "Epic", "Description": "Epic uses the net use, net session, and netstat commands to gather information on network connections.[11][12]"}, {"link": "https://attack.mitre.org/software/S0237", "Name": "GravityRAT", "Description": "GravityRAT uses the netstat command to find open ports on the victim’s machine.[24]"}, {"link": "https://attack.mitre.org/software/S0283", "Name": "jRAT", "Description": "jRAT can list network connections.[28]"}, {"link": "https://attack.mitre.org/groups/G0004", "Name": "Ke3chang", "Description": "Ke3chang performs local network connection discovery using netstat.[40][41]"}, {"link": "https://attack.mitre.org/software/S0236", "Name": "Kwampirs", "Description": "Kwampirs collects a list of active and listening connections by using the command netstat -nao as well as a list of available network mappings with net use.[16]"}, {"link": "https://attack.mitre.org/software/S0409", "Name": "Machete", "Description": "Machete uses the netsh wlan show networks mode=bssid and netsh wlan show interfaces commands to list all nearby WiFi networks and connected interfaces. [30]"}, {"link": "https://attack.mitre.org/groups/G0045", "Name": "menuPass", "Description": "menuPass has used net use to conduct connectivity checks to machines.[32]"}, {"link": "https://attack.mitre.org/software/S0102", "Name": "nbtstat", "Description": "nbtstat can be used to discover current NetBIOS sessions."}, {"link": "https://attack.mitre.org/software/S0039", "Name": "Net", "Description": "Commands such as net use and net session can be used in Net to gather information about network connections from a particular host.[6]"}, {"link": "https://attack.mitre.org/software/S0104", "Name": "netstat", "Description": "netstat can be used to enumerate local network connections, including active TCP connections and other network statistics.[5]"}, {"link": "https://attack.mitre.org/groups/G0049", "Name": "OilRig", "Description": "OilRig has used netstat -an on a victim to get a listing of network connections.[33]"}, {"link": "https://attack.mitre.org/software/S0165", "Name": "OSInfo", "Description": "OSInfo enumerates the current network connections similar to  net use .[10]"}, {"link": "https://attack.mitre.org/software/S0013", "Name": "PlugX", "Description": "PlugX has a module for enumerating TCP and UDP network connections and associated processes using the netstat command.[26]"}, {"link": "https://attack.mitre.org/groups/G0033", "Name": "Poseidon Group", "Description": "Poseidon Group obtains and saves information about victim network interfaces and addresses.[31]"}, {"link": "https://attack.mitre.org/software/S0378", "Name": "PoshC2", "Description": "PoshC2 contains an implementation of netstat to enumerate TCP and UDP connections.[8]"}, {"link": "https://attack.mitre.org/software/S0184", "Name": "POWRUNER", "Description": "POWRUNER may collect active network connections by running netstat -an on a victim.[13]"}, {"link": "https://attack.mitre.org/software/S0192", "Name": "Pupy", "Description": "Pupy has a built-in utility command for netstat, can do net session through PowerView, and has an interactive shell which can be used to discover additional information.[4]"}, {"link": "https://attack.mitre.org/software/S0241", "Name": "RATANKBA", "Description": "RATANKBA uses netstat -ano to search for specific IP address ranges.[9]"}, {"link": "https://attack.mitre.org/software/S0153", "Name": "RedLeaves", "Description": "RedLeaves can enumerate drives and Remote Desktop sessions.[25]"}, {"link": "https://attack.mitre.org/software/S0125", "Name": "Remsec", "Description": "Remsec can obtain a list of active connections and open ports.[17]"}, {"link": "https://attack.mitre.org/software/S0063", "Name": "SHOTPUT", "Description": "SHOTPUT uses netstat to list TCP connection status.[20]"}, {"link": "https://attack.mitre.org/groups/G0093", "Name": "Soft Cell", "Description": "Soft Cell used netstat -oan to obtain information about the victim network connections.[43]"}, {"link": "https://attack.mitre.org/software/S0374", "Name": "SpeakUp", "Description": "SpeakUp uses the arp -a command.[27]"}, {"link": "https://attack.mitre.org/software/S0018", "Name": "Sykipot", "Description": "Sykipot may use netstat -ano to display active network connections.[15]"}, {"link": "https://attack.mitre.org/groups/G0027", "Name": "Threat Group-3390", "Description": "Threat Group-3390 has used net use to conduct internal discovery of systems. The group has also used quser.exe to identify existing RDP sessions on a victim.[34]"}, {"link": "https://attack.mitre.org/groups/G0010", "Name": "Turla", "Description": "Turla surveys a system upon check-in to discover active local network connections using the netstat -an, net use, net file, and net session commands. Turla RPC backdoors have also enumerated the IPv4 TCP connection table via the GetTcpTable2 API call.[11][42]"}, {"link": "https://attack.mitre.org/software/S0180", "Name": "Volgmer", "Description": "Volgmer can gather information about TCP connection state.[21]"}, {"link": "https://attack.mitre.org/software/S0251", "Name": "Zebrocy", "Description": "Zebrocy uses netstat -aon to gather network connection information.[29]"}]}