{"title": "System Shutdown and Reboot", "descrption": "\nAdversaries may shutdown/reboot systems to interrupt access to, or aid in the destruction of, those systems. Operating systems may contain commands to initiate a shutdown/reboot of a machine. In some cases, these commands may also be used to initiate a shutdown/reboot of a remote computer. Shutting down or rebooting systems may disrupt access to computer resources for legitimate users.Adversaries may attempt to shutdown/reboot a system after impacting it in other ways, such as Disk Structure Wipe or Inhibit System Recovery, to hasten the intended effects on system availability.\n", "ID": "T1529", "Tactic": "Impact", "Platform": "Linux, macOS, Windows", "Permissions Required": "User, Administrator, root, SYSTEM", "Data Sources": "Windows event logs, Process command-line parameters, Process monitoring", "Impact Type": "Availability", "Version": "1.0", "Created": "04 October 2019", "Last Modified": "09 October 2019", "related": [{"link": "https://attack.mitre.org/groups/G0067", "Name": "APT37", "Description": "APT37 has used malware that will issue the command shutdown /r /t 1 to reboot a system after wiping its MBR.[5]"}, {"link": "https://attack.mitre.org/groups/G0082", "Name": "APT38", "Description": "APT38 has used a custom MBR wiper named BOOTWRECK, which will initiate a system reboot after wiping the victim's MBR.[6]"}, {"link": "https://attack.mitre.org/groups/G0032", "Name": "Lazarus Group", "Description": "Lazarus Group has rebooted systems after destroying files and wiping the MBR on infected systems.[7]"}, {"link": "https://attack.mitre.org/software/S0372", "Name": "LockerGoga", "Description": "LockerGoga has been observed shutting down infected systems.[4]"}, {"link": "https://attack.mitre.org/software/S0368", "Name": "NotPetya", "Description": "NotPetya will reboot the system one hour after infection.[2]"}, {"link": "https://attack.mitre.org/software/S0365", "Name": "Olympic Destroyer", "Description": "Olympic Destroyer will shut down the compromised system after it is done modifying system configuration settings.[3]"}]}